In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from scipy import stats
from scipy.stats import norm, binom
from scipy.stats import poisson
import seaborn as sns
import env
np.random.seed(123)

In [2]:
from env import host, user, password
database = "iris_db"

def get_db_url(user,host,password,database):

    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    return url

url = get_db_url(user,host,password,database)

database_name = "iris_db"
query = """ 
            SELECT *
            FROM measurements as m
            JOIN species as s
            USING (species_id)
        """
df_iris = pd.read_sql(query, url)

# 4) In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [3]:
# print the first 3 rows

df_iris.head(3)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa

In [4]:
#print the number of rows and columns (shape)

df_iris.shape

(150, 7)

In [5]:
#print the column names

df_iris.columns

Index(['species_id', 'measurement_id', 'sepal_length', 'sepal_width',
       'petal_length', 'petal_width', 'species_name'],
      dtype='object')

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   measurement_id  150 non-null    int64
 2   sepal_length    150 non-null    float64
 3   sepal_width     150 non-null    float64
 4   petal_length    150 non-null    float64
 5   petal_width     150 non-null    float64
 6   species_name    150 non-null    object
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB

In [7]:
# print the data type of each column

df_iris.dtypes

species_id          int64
measurement_id      int64
sepal_length      float64
sepal_width       float64
petal_length      float64
petal_width       float64
species_name       object
dtype: object

In [8]:
# print the summary statistics for each of the numeric variables


df_iris.describe()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,2.000000,75.500000,5.843333,3.057333,3.758000,1.199333
std,0.819232,43.445368,0.828066,0.435866,1.765298,0.762238
min,1.000000,1.000000,4.300000,2.000000,1.000000,0.100000
25%,1.000000,38.250000,5.100000,2.800000,1.600000,0.300000
50%,2.000000,75.500000,5.800000,3.000000,4.350000,1.300000
75%,3.000000,112.750000,6.400000,3.300000,5.100000,1.800000
max,3.000000,150.000000,7.900000,4.400000,6.900000,2.500000

# 5) Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

In [9]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1d5Zzy-wq9-tnXnKbhaoDEuOnD_7NqXGyPfr7UTIwNmQ/edit#gid=1023018493'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google_sheets = pd.read_csv(csv_export_url)
df_google_sheets.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No,72.1
1,0257-ZESQC,Female,1,Yes,No,1,2,0,Bank transfer (automatic),75.20,1929.35,Yes,25.7
2,0442-ZXKVS,Female,1,Yes,No,2,2,1,Bank transfer (automatic),115.60,6431.05,No,55.6
3,0993-OSGPT,Female,1,Yes,No,1,1,1,Bank transfer (automatic),60.65,3975.90,No,65.6
4,1167-OYZJF,Female,1,Yes,No,1,0,2,Bank transfer (automatic),20.05,1263.05,No,63.0

In [10]:
# assign the first 100 rows to a new dataframe, 
# df_google_sheets_sample

df_google_sheets_sample = df_google_sheets.iloc[:100]

In [11]:
df_google_sheets_sample.shape

(100, 13)

In [12]:
df_google_sheets_sample

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No,72.1
1,0257-ZESQC,Female,1,Yes,No,1,2,0,Bank transfer (automatic),75.20,1929.35,Yes,25.7
2,0442-ZXKVS,Female,1,Yes,No,2,2,1,Bank transfer (automatic),115.60,6431.05,No,55.6
3,0993-OSGPT,Female,1,Yes,No,1,1,1,Bank transfer (automatic),60.65,3975.90,No,65.6
4,1167-OYZJF,Female,1,Yes,No,1,0,2,Bank transfer (automatic),20.05,1263.05,No,63.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,6397-JNZZG,Female,1,Yes,No,0,1,0,Credit card (automatic),55.55,2342.20,Yes,42.2
96,6425-YQLLO,Female,1,Yes,No,2,2,1,Credit card (automatic),105.95,6975.25,Yes,65.8
97,6437-UDQJM,Female,1,Yes,No,2,1,2,Credit card (automatic),84.10,6129.65,No,72.9
98,6575-SUVOI,Female,1,Yes,No,2,1,0,Credit card (automatic),69.50,1752.65,No,25.2
99,6723-WSNTY,Female,1,Yes,No,2,2,1,Credit card (automatic),108.10,7181.95,No,66.4

In [13]:
# print the number of rows of your original dataframe
df_google_sheets.shape

(7049, 13)

In [14]:
# print the first 5 column names

# df_google_sheets.columns
   
# list(df_google_sheets)

N = 5
# Select first N columns
df_googlesheets  = df_google_sheets.iloc[: , :N]
list(df_googlesheets.columns)

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

In [15]:
df_google_sheets.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
tenure               float64
dtype: object

In [16]:
# print the column names that have a data type of object
df_google_sheets.select_dtypes(include=['object'])

     customer_id  gender partner dependents               payment_type churn
0     0013-SMEOE  Female     Yes         No  Bank transfer (automatic)    No
1     0257-ZESQC  Female     Yes         No  Bank transfer (automatic)   Yes
2     0442-ZXKVS  Female     Yes         No  Bank transfer (automatic)    No
3     0993-OSGPT  Female     Yes         No  Bank transfer (automatic)    No
4     1167-OYZJF  Female     Yes         No  Bank transfer (automatic)    No
...          ...     ...     ...        ...                        ...   ...
7044  9863-JZAIC    Male      No         No               Mailed check   Yes
7045  9932-WBWIK    Male      No         No               Mailed check    No
7046  9953-ZMKSM    Male      No         No               Mailed check    No
7047  9975-SKRNR    Male      No         No               Mailed check    No
7048  9992-UJOEL    Male      No         No               Mailed check    No

[7049 rows x 6 columns]

In [17]:
# compute the range for each of the numeric variables.

df_google_sheets.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,tenure
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000,7049.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883,32.380068
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984,24.594926
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000,0.000000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500,8.700000
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000,28.700000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000,55.200000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000,79.300000

# 6) Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [18]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1d5Zzy-wq9-tnXnKbhaoDEuOnD_7NqXGyPfr7UTIwNmQ/edit#gid=1023018493'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_excel = pd.read_csv(csv_export_url)
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No,72.1
1,0257-ZESQC,Female,1,Yes,No,1,2,0,Bank transfer (automatic),75.20,1929.35,Yes,25.7
2,0442-ZXKVS,Female,1,Yes,No,2,2,1,Bank transfer (automatic),115.60,6431.05,No,55.6
3,0993-OSGPT,Female,1,Yes,No,1,1,1,Bank transfer (automatic),60.65,3975.90,No,65.6
4,1167-OYZJF,Female,1,Yes,No,1,0,2,Bank transfer (automatic),20.05,1263.05,No,63.0

In [19]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel.head(100)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No,72.1
1,0257-ZESQC,Female,1,Yes,No,1,2,0,Bank transfer (automatic),75.20,1929.35,Yes,25.7
2,0442-ZXKVS,Female,1,Yes,No,2,2,1,Bank transfer (automatic),115.60,6431.05,No,55.6
3,0993-OSGPT,Female,1,Yes,No,1,1,1,Bank transfer (automatic),60.65,3975.90,No,65.6
4,1167-OYZJF,Female,1,Yes,No,1,0,2,Bank transfer (automatic),20.05,1263.05,No,63.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,6397-JNZZG,Female,1,Yes,No,0,1,0,Credit card (automatic),55.55,2342.20,Yes,42.2
96,6425-YQLLO,Female,1,Yes,No,2,2,1,Credit card (automatic),105.95,6975.25,Yes,65.8
97,6437-UDQJM,Female,1,Yes,No,2,1,2,Credit card (automatic),84.10,6129.65,No,72.9
98,6575-SUVOI,Female,1,Yes,No,2,1,0,Credit card (automatic),69.50,1752.65,No,25.2
99,6723-WSNTY,Female,1,Yes,No,2,2,1,Credit card (automatic),108.10,7181.95,No,66.4

In [20]:
# print the number of rows of your original dataframe

df_excel.shape

(7049, 13)

In [21]:
# print the first 5 column names

df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No,72.1
1,0257-ZESQC,Female,1,Yes,No,1,2,0,Bank transfer (automatic),75.20,1929.35,Yes,25.7
2,0442-ZXKVS,Female,1,Yes,No,2,2,1,Bank transfer (automatic),115.60,6431.05,No,55.6
3,0993-OSGPT,Female,1,Yes,No,1,1,1,Bank transfer (automatic),60.65,3975.90,No,65.6
4,1167-OYZJF,Female,1,Yes,No,1,0,2,Bank transfer (automatic),20.05,1263.05,No,63.0

In [22]:
# print the column names that have a data type of object

df_excel.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
tenure               float64
dtype: object

In [23]:
df_excel.select_dtypes(include=['object'])

     customer_id  gender partner dependents               payment_type churn
0     0013-SMEOE  Female     Yes         No  Bank transfer (automatic)    No
1     0257-ZESQC  Female     Yes         No  Bank transfer (automatic)   Yes
2     0442-ZXKVS  Female     Yes         No  Bank transfer (automatic)    No
3     0993-OSGPT  Female     Yes         No  Bank transfer (automatic)    No
4     1167-OYZJF  Female     Yes         No  Bank transfer (automatic)    No
...          ...     ...     ...        ...                        ...   ...
7044  9863-JZAIC    Male      No         No               Mailed check   Yes
7045  9932-WBWIK    Male      No         No               Mailed check    No
7046  9953-ZMKSM    Male      No         No               Mailed check    No
7047  9975-SKRNR    Male      No         No               Mailed check    No
7048  9992-UJOEL    Male      No         No               Mailed check    No

[7049 rows x 6 columns]

In [24]:
# compute the range for each of the numeric variables.

df_excel.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,tenure
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000,7049.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883,32.380068
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984,24.594926
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000,0.000000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500,8.700000
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000,28.700000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000,55.200000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000,79.300000

# 7) Read the data from this google sheet into a dataframe, df_google.

In [25]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
# print the first 3 rows

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [27]:
# print the number of rows and columns

df_google.shape

(891, 12)

In [28]:
# print the column names

df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [29]:
# print the data type of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [30]:
# print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [31]:
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
# print the unique values for each of your categorical variables

print(df_google['PassengerId'].nunique())

891

In [33]:
print(df_google['Embarked'].unique())

['S' 'C' 'Q' nan]

In [39]:
cat_col = ['Survived', 'Pclass', 'Sex', 'Embarked' ]

In [40]:
for column in cat_col:
    print(df_google[column].value_counts())

0    549
1    342
Name: Survived, dtype: int64
3    491
1    216
2    184
Name: Pclass, dtype: int64
male      577
female    314
Name: Sex, dtype: int64
S    644
C    168
Q     77
Name: Embarked, dtype: int64